InformationRegisters/НастройкиАвтораспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиАвтораспределения</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСотрудника</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СотрудникиАвтораспределения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СотрудникиАвтораспределения</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УчаствуетВРаспределении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиАвтораспределения/Forms/ФормаНастройки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Набор = РегистрыСведений.НастройкиАвтораспределения.СоздатьМенеджерЗаписи();
	Набор.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	АвтораспределениеВключено = Набор.Включено;
	ВариантАвтораспределения = Набор.ВариантРаспределения;
	ТипСотрудника = Набор.ТипСотрудника;	
	
	Набор = РегистрыСведений.СотрудникиАвтораспределения.СоздатьНаборЗаписей();
	Набор.Отбор.Ответственный.Использование = Истина;
	Набор.Отбор.Ответственный.Значение = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	Сотрудники.Загрузить(Набор.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	Модифицированность = Истина;	
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	Если ПараметрыСеанса.ТекущийПользователь.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.НастройкиАвтораспределения.СоздатьМенеджерЗаписи();
	Набор.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	Набор.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Набор.Включено = АвтораспределениеВключено;
	Набор.ВариантРаспределения = ВариантАвтораспределения;
	Набор.ТипСотрудника = ТипСотрудника;
	Набор.Записать();
		
	Набор = РегистрыСведений.СотрудникиАвтораспределения.СоздатьНаборЗаписей();
	Набор.Отбор.Ответственный.Использование = Истина;
	Набор.Отбор.Ответственный.Значение = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	ТЗ = Сотрудники.Выгрузить();
	ТЗ.ЗаполнитьЗначения(ПараметрыСеанса.ТекущийПользователь, "Ответственный");
	Набор.Загрузить(ТЗ);
	Набор.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	Если Модифицированность Тогда
		СохранитьНастройки();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры
